### Q1 For the following code, which of the following statements will not return True?

In [1]:
import pandas as pd

sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)

In [5]:
obj2

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [2]:
import math
math.isnan(obj2['California'])

True

In [3]:
x = obj2['California']
obj2['California'] != x

True

In [6]:
obj3['California']

True

In [7]:
obj2['California'] == None

False

### Q2 In the below python code, the keys of the dictionary d represent student ranks and the value for each key is a student name. Which of the following can be used to extract rows with student ranks that are lower than or equal to 3?

In [8]:
import pandas as pd
d = {
    '1': 'Alice',
    '2': 'Bob',
    '3': 'Rita',
    '4': 'Molly',
    '5': 'Ryan'
}
S = pd.Series(d)

In [10]:
S

1    Alice
2      Bob
3     Rita
4    Molly
5     Ryan
dtype: object

In [16]:
S.iloc[0:3]

1    Alice
2      Bob
3     Rita
dtype: object

### Q3 Suppose we have a DataFrame named df. We want to change the original DataFrame df in a way that all the column names are cast to upper case. Which of the following expressions is incorrect to perform the same?

In [17]:
html_string = """
<table>
  <thead>
    <tr>
      <th>date</th>
      <th>name</th>
      <th>year</th>
      <th>cost</th>
      <th>region</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <td>2020-01-01</td>
      <td>Jenny</td>
      <td>1998</td>
      <td>0.2</td>
      <td>South</td>
    </tr>
    <tr>
      <td>2020-01-02</td>
      <td>Alice</td>
      <td>1992</td>
      <td>-1.34</td>
      <td>East</td>
    </tr>
    <tr>
      <td>2020-01-03</td>
      <td>Tomas</td>
      <td>1982</td>
      <td>1.00023</td>
      <td>South</td>
    </tr>
  </tbody>
</table>
"""

In [45]:
dfs = pd.read_html(html_string)
type(dfs)

list

In [52]:
df = dfs[0]
df

         date   name  year     cost region
0  2020-01-01  Jenny  1998  0.20000  South
1  2020-01-02  Alice  1992 -1.34000   East
2  2020-01-03  Tomas  1982  1.00023  South

In [44]:
# correct
df.rename(mapper = lambda x: x.upper(), axis=1, inplace=True)
df

         DATE   NAME  YEAR     COST REGION
0  2020-01-01  Jenny  1998  0.20000  South
1  2020-01-02  Alice  1992 -1.34000   East
2  2020-01-03  Tomas  1982  1.00023  South

In [47]:
# correct
df = df.rename(mapper = lambda x: x.upper(), axis = 'columns')
df

         DATE   NAME  YEAR     COST REGION
0  2020-01-01  Jenny  1998  0.20000  South
1  2020-01-02  Alice  1992 -1.34000   East
2  2020-01-03  Tomas  1982  1.00023  South

In [38]:
# correct
df = df.rename(mapper = lambda x: x.upper(), axis = 1)

         DATE   NAME  YEAR     COST REGION
0  2020-01-01  Jenny  1998  0.20000  South
1  2020-01-02  Alice  1992 -1.34000   East
2  2020-01-03  Tomas  1982  1.00023  South

In [53]:
# incorrect
df.rename(mapper = lambda x: x.upper(), axis=1)
df

         date   name  year     cost region
0  2020-01-01  Jenny  1998  0.20000  South
1  2020-01-02  Alice  1992 -1.34000   East
2  2020-01-03  Tomas  1982  1.00023  South

### Q4 For the given DataFrame df we want to keep only the records with a toefl score greater than 105. Which of the following will not work?

In [60]:
df = pd.DataFrame(columns = ['serial-no','gre-score', 'toefl-score'])
df['serial-no'] = [1,2,3,4,5]
df['gre-score'] = [337,324,316,322,314]
df['toefl-score'] = [118,107,104,110,103]
df

   serial-no  gre-score  toefl-score
0          1        337          118
1          2        324          107
2          3        316          104
3          4        322          110
4          5        314          103

In [61]:
# correct
df[df['toefl-score'] > 105]

   serial-no  gre-score  toefl-score
0          1        337          118
1          2        324          107
3          4        322          110

In [62]:
# correct
df.where(df['toefl-score'] > 105).dropna()

   serial-no  gre-score  toefl-score
0        1.0      337.0        118.0
1        2.0      324.0        107.0
3        4.0      322.0        110.0

In [63]:
# incorrect
df.where(df['toefl-score'] > 105)

   serial-no  gre-score  toefl-score
0        1.0      337.0        118.0
1        2.0      324.0        107.0
2        NaN        NaN          NaN
3        4.0      322.0        110.0
4        NaN        NaN          NaN

### Q5 Which of the following can be used to create a DataFrame in Pandas?

- 2D ndarray
- Pandas Series object
- Python dict
- **All of the above**

### Q6 Which of the following is an incorrect way to drop entries from the Pandas DataFrame named df shown below?

In [93]:
index = ['Ohio', 'Colorado', 'Utah', 'New York']
columns = ['one','two','three','four']
df = pd.DataFrame([[0,1,2,3],[4,5,6,7],[8,9,10,11],[12,13,14,15]],index=index, columns=columns)
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [88]:
# correct
df.drop(['Utah', 'Colorado'])

          one  two  three  four
Ohio        0    1      2     3
New York   12   13     14    15

In [90]:
# correct
df.drop('Ohio')

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [92]:
# correct
df.drop('one', axis=1)

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [94]:
# incorrect
df.drop('two')

KeyError: "['two'] not found in axis"

### Q7 - Create your own MCQ

In [137]:
index = ['Anna', 'Bob', 'Cathy', 'Danny']
columns = ['apples','oranges','bananas','pears']
df = pd.DataFrame([[5,2,1,4],[2,11,2,5],[0,7,4,1],[6,7,7,0]],index=index, columns=columns)
df

       apples  oranges  bananas  pears
Anna        5        2        1      4
Bob         2       11        2      5
Cathy       0        7        4      1
Danny       6        7        7      0

In [138]:
# Extract the name of the person with the most number of oranges
# option 1 - correct
df.iloc[df['oranges'].argmax()].name

'Bob'

In [140]:
# option 2 - wrong
df['oranges'].max().name

AttributeError: 'int' object has no attribute 'name'

In [144]:
# option 3 - wrong
df.where(df['oranges'] == df['oranges'].max())

       apples  oranges  bananas  pears
Anna      NaN      NaN      NaN    NaN
Bob       2.0     11.0      2.0    5.0
Cathy     NaN      NaN      NaN    NaN
Danny     NaN      NaN      NaN    NaN

In [161]:
# option 4 - wrong
df.filter(['oranges'])

       oranges
Anna         2
Bob         11
Cathy        7
Danny        7